; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x5-y5-t3-k222-l222-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f 
        shape0 shape1 shape2 
        key0-0 key0-1 
        key1-0 key1-1 
        key2-0 key2-1 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(shape shape0)
(shape shape1)
(shape shape2)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(open f2-0f)
(open f4-0f)
(open f0-1f)
(open f1-1f)
(open f3-1f)
(open f4-1f)
(open f0-2f)
(open f1-2f)
(open f2-2f)
(open f3-2f)
(open f4-2f)
(open f0-3f)
(open f1-3f)
(open f2-3f)
(open f3-3f)
(open f4-3f)
(open f0-4f)
(open f2-4f)
(open f4-4f)
(locked f1-0f)
(lock-shape f1-0f shape0)
(locked f3-0f)
(lock-shape f3-0f shape0)
(locked f0-0f)
(lock-shape f0-0f shape1)
(locked f2-1f)
(lock-shape f2-1f shape1)
(locked f1-4f)
(lock-shape f1-4f shape2)
(locked f3-4f)
(lock-shape f3-4f shape2)
(at key0-0 f3-4f)
(at key0-1 f2-1f)
(at key1-0 f4-0f)
(at key1-1 f1-0f)
(at key2-0 f0-2f)
(at key2-1 f3-3f)
(at-robot f1-1f)
)
(:goal
(and
(at key0-1 f0-2f)
(at key2-1 f1-4f)
)
)
)

; plan
1. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 0 of 2
2. (move f1-2f f1-3f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-3f)
   goals met: 0 of 2
3. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 0 of 2
4. (move f2-3f f3-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f3-3f)
   goals met: 0 of 2
5. (pickup f3-3f key2-1)
   deleted: (at key2-1 f3-3f) (arm-empty)
   added: (holding key2-1)
   goals met: 0 of 2
6. (move f3-3f f2-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f2-3f)
   goals met: 0 of 2
7. (move f2-3f f1-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f1-3f)
   goals met: 0 of 2
8. (unlock f1-3f f1-4f key2-1 shape2)
   deleted: (locked f1-4f)
   added: (open f1-4f)
   goals met: 0 of 2
9. (move f1-3f f1-2f)
   deleted: (at-robot f1-3f)
   added: (at-robot f1-2f)
   goals met: 0 of 2
10. (move f1-2f f2-2f)
   deleted: (at-robot f1-2f)
   added: (at-robot f2-2f)
   goals met: 0 of 2
11. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 0 of 2
12. (move f3-2f f4-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f4-2f)
   goals met: 0 of 2
13. (move f4-2f f4-1f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-1f)
   goals met: 0 of 2
14. (move f4-1f f4-0f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-0f)
   goals met: 0 of 2
15. (pickup-and-loose f4-0f key1-0 key2-1)
   deleted: (holding key2-1) (at key1-0 f4-0f)
   added: (holding key1-0) (at key2-1 f4-0f)
   goals met: 0 of 2
16. (move f4-0f f4-1f)
   deleted: (at-robot f4-0f)
   added: (at-robot f4-1f)
   goals met: 0 of 2
17. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 0 of 2
18. (unlock f3-1f f2-1f key1-0 shape1)
   deleted: (locked f2-1f)
   added: (open f2-1f)
   goals met: 0 of 2
19. (move f3-1f f2-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f2-1f)
   goals met: 0 of 2
20. (pickup-and-loose f2-1f key0-1 key1-0)
   deleted: (holding key1-0) (at key0-1 f2-1f)
   added: (holding key0-1) (at key1-0 f2-1f)
   goals met: 0 of 2
21. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 0 of 2
22. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 0 of 2
23. (move f1-2f f0-2f)
   deleted: (at-robot f1-2f)
   added: (at-robot f0-2f)
   goals met: 0 of 2
24. (putdown f0-2f key0-1)
   deleted: (holding key0-1)
   added: (arm-empty) (at key0-1 f0-2f)
   goals met: 1 of 2
25. (move f0-2f f0-3f)
   deleted: (at-robot f0-2f)
   added: (at-robot f0-3f)
   goals met: 1 of 2
26. (move f0-3f f1-3f)
   deleted: (at-robot f0-3f)
   added: (at-robot f1-3f)
   goals met: 1 of 2
27. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 1 of 2
28. (move f2-3f f3-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f3-3f)
   goals met: 1 of 2
29. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 1 of 2
30. (move f3-2f f4-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f4-2f)
   goals met: 1 of 2
31. (move f4-2f f4-1f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-1f)
   goals met: 1 of 2
32. (move f4-1f f4-0f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-0f)
   goals met: 1 of 2
33. (pickup f4-0f key2-1)
   deleted: (at key2-1 f4-0f) (arm-empty)
   added: (holding key2-1)
   goals met: 1 of 2
34. (move f4-0f f4-1f)
   deleted: (at-robot f4-0f)
   added: (at-robot f4-1f)
   goals met: 1 of 2
35. (move f4-1f f4-2f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-2f)
   goals met: 1 of 2
36. (move f4-2f f3-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f3-2f)
   goals met: 1 of 2
37. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 1 of 2
38. (move f3-3f f2-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f2-3f)
   goals met: 1 of 2
39. (move f2-3f f2-4f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-4f)
   goals met: 1 of 2
40. (move f2-4f f1-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f1-4f)
   goals met: 1 of 2
41. (putdown f1-4f key2-1)
   deleted: (holding key2-1)
   added: (arm-empty) (at key2-1 f1-4f)
   goals met: 2 of 2
